// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我~",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "心爱的老婆大人小甜心猪咩咩！",  // 同上...
        "今天是你的生日～",
        "这是我们在一起的",
        "第二个生日～",
        "还记得去年我生日的时候",
        "你给了我一个二维码哝～",
        "今年我同样也发给你一个～！",
        "你是我的老婆大人哝！！！",
        "希望你可以永远在我这做个小孩～",
        "愿你贪吃长胖 健健康康～",
        "愿你心想事成 天天开心～",
        "愿你多多运动 聪慧活泼～",
        "愿我们无论咋样一起走下去！",
        "只愿得你心 白首不分离",
        "这简单的话语 是老公最真挚的祝福～！",
        "mua～～～～！muaaaamuamua！～",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
       "送给我~": "./imgs/6.png",
       "心爱的老婆大人小甜心猪咩咩！": "./imgs/7.png",
       "今天是你的生日～": "./imgs/8.png",
       "这是我们在一起的": "./imgs/9.png",
       "第二个生日～": "./imgs/10.png",
       "还记得去年我生日的时候": "./imgs/11.png",
       "你给了我一个二维码哝～": "./imgs/12.png",
       "今年我同样也发给你一个～！": "./imgs/13.png",
       "你是我的老婆大人哝！！！": "./imgs/14.png",
       "希望你可以永远在我这做个小孩～": "./imgs/15.png",
       "愿你贪吃长胖 健健康康～": "./imgs/16.png",
       "愿你心想事成 天天开心～": "./imgs/17.png",
       "愿你多多运动 聪慧活泼～": "./imgs/18.png",
       "愿我们无论咋样一起走下去！": "./imgs/19.png",
       "只愿得你心 白首不分离": "./imgs/20.png",
       "这简单的话语 是老公最真挚的祝福～！": "./imgs/21.png",
       "mua～～～～！muaaaamuamua！～": "./imgs/22.png",

    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "点我点我～",
        play: "来点 music！",
        bannar_coming: "得整点颜色哝～",
        balloons_flying: "好像少点东西？",
        cake_fadein: "蛋糕？！",
        light_candle: "蜡烛？！",
        wish_message: "祝我的老婆大人生日快乐！！",
        story: "送上老公我真挚的祝福",
    }
};
